---
kind: other
id: Properties.T:Autodesk.Revit.DB.RoutingCondition
source: html/be0c9b6c-86ad-0772-9947-4c4aa97bec48.htm
---
# RoutingCondition Properties

The diameter of the segment or fitting specified for the routing condition.